---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.ChangeUnitsFormatWarn
source: html/f62b4960-49d5-3447-d1f3-5b6fe99d2e48.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.ChangeUnitsFormatWarn Property

The modification of the unit will cause the change of the Reinforcement rounding format. Do you want to continue?

## Syntax (C#)
```csharp
public static FailureDefinitionId ChangeUnitsFormatWarn { get; }
```